fn main() {
    Solution::make_star(24)
}


// https://www.acmicpc.net/problem/2448
/// 예제를 보고 규칙을 유추한 뒤에 별을 찍어 보세요.
/// 첫째 줄에 N이 주어진다. N은 항상 3×2^k 수이다. (3, 6, 12, 24, 48, ...) (0 ≤ k ≤ 10, k는 정수)
/// n=>24
//                        *
//                       * *
//                      *****
//                     *     *
//                    * *   * *
//                   ***** *****
//                  *           *
//                 * *         * *
//                *****       *****
//               *     *     *     *
//              * *   * *   * *   * *
//             ***** ***** ***** *****
//            *                       *
//           * *                     * *
//          *****                   *****
//         *     *                 *     *
//        * *   * *               * *   * *
//       ***** *****             ***** *****
//      *           *           *           *
//     * *         * *         * *         * *
//    *****       *****       *****       *****
//   *     *     *     *     *     *     *     *
//  * *   * *   * *   * *   * *   * *   * *   * *
// ***** ***** ***** ***** ***** ***** ***** *****

struct Solution;


impl Solution {
    pub fn make_star(n: i32) {
        for pad in 0..n {
            for _ in 0..n-pad {
                print!(" ");
            }
            match pad % 3 {
                0 => {}
                1 => {}
                2 => {}
                _ => {}
            }
            print!("{} {} ",1+pad/3,1+pad%3);
            println!("*");
        }
    }
}